src/cf/src/DataProcessors/ФормированиеЗаказовПоставщику/ФормированиеЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеЗаказовПоставщику</name>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Расход</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоЗапросу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказыКлиентов</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказано</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказаноВнутр</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЕдиницыХранения</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>DefinedType.КодСтроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/DataProcessors/ФормированиеЗаказовПоставщику/Forms/Форма/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьОстаткиИОбороты();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ЗаполнитьПоОстаткамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеТоваров(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораГруппыТоваров", ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказы(Команда)
	Если ЭтоКладовщик Тогда 
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		ДанныеЗаполнения.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
		ДанныеЗаполнения.Вставить("МасТовары", Новый Массив);
		Для Каждого Стр Из Объект.ТЧТовары Цикл
			Если Стр.КоличествоУпаковок = 0 Тогда Продолжить КонецЕсли;
			ДанныеЗаполнения.МасТовары.Добавить(РаботаСДокументамиКлиентСервер.ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект));	
		КонецЦикла;
		Если СоздатьЗаказНаСервере(ДанныеЗаполнения) Тогда
			ПоказатьПредупреждение(,Нстр("fr = 'La commande est générée'; ru = 'Заказ сформирован'; en = 'The order has been formed'; es = 'Orden formada'"),5);
			ЗаполнитьОстаткиИОбороты();
		КонецЕсли;
	Иначе
		МасКонтрагенты = ПолучитьУстановленныхКонтрагентов();
		Для Каждого Контрагент Из МасКонтрагенты Цикл		
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Контрагент", Контрагент);
			ДанныеЗаполнения.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
			ДанныеЗаполнения.Вставить("МасТовары", Новый Массив);
			МасТовары = Объект.ТЧТовары.НайтиСтроки(Новый Структура("Контрагент", Контрагент));
			Для Каждого Стр Из МасТовары Цикл
				Если Стр.КоличествоУпаковок = 0 Тогда Продолжить КонецЕсли;
				ДанныеЗаполнения.МасТовары.Добавить(РаботаСДокументамиКлиентСервер.ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, ПредопределенноеЗначение("Документ.ЗаказПоставщику.ПустаяСсылка")));	
			КонецЦикла;
			П = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
			Оп = Новый ОписаниеОповещения("ПослеСозданияЗаказа",ЭтотОбъект);
			ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаДокумента", П, ЭтаФорма, Контрагент,,,Оп);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураКонтрагентаПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатурыКонтрагента(ТекСтр, Объект);	
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(ТекСтр, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтр = Объект.ТЧТовары.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Поле = Элементы.ТЧТоварыЗаказано Тогда
		СтандартнаяОбработка = Ложь; 
		Оп = Новый ОписаниеОповещения("ПослеВыбораЗаказа",ЭтотОбъект);
		ПоказатьВыборИзСписка(Оп,ПолучитьСписокЗаказов(ТекСтр.Номенклатура,ТекСтр.Характеристика));
	ИначеЕсли Поле = Элементы.ТЧТоварыЗаказаноВнутр Тогда
		СтандартнаяОбработка = Ложь; 
		Оп = Новый ОписаниеОповещения("ПослеВыбораЗаказа",ЭтотОбъект);
		ПоказатьВыборИзСписка(Оп,ПолучитьСписокЗаказов(ТекСтр.Номенклатура,ТекСтр.Характеристика));
	КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораГруппыТоваров(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	ЗаполнитьПоГруппеТоваровНаСервере(РезультатЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗаказа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	Если Не РезультатЗакрытия = Неопределено Тогда
		ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаДокумента",Новый Структура("Ключ",РезультатЗакрытия.Значение),,Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияЗаказа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	ЗаполнитьОстаткиИОбороты();
КонецПроцедуры
	
#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	                      |	0 КАК Количество
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии.Остатки(
	                      |			,
	                      |			ВЫБОР
	                      |				КОГДА Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |					ТОГДА ИСТИНА
	                      |				ИНАЧЕ НЕ Характеристика.ДляВнутреннегоИспользования
	                      |			КОНЕЦ) КАК ТоварыВНаличииОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВНаличииОстатки.Номенклатура,
	                      |	ТоварыВНаличииОстатки.Характеристика
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТоварыВНаличииОстатки.Номенклатура.Наименование,
	                      |	ТоварыВНаличииОстатки.Характеристика.Наименование");
	СформироватьДанные(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеТоваровНаСервере(Группа)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	                      |	0 КАК Количество
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |		ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	                      |			И (НЕ ХарактеристикиНоменклатуры.ДляВнутреннегоИспользования)
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
	                      |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	                      |	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Номенклатура.Наименование");
	Запрос.УстановитьПараметр("Группа", Группа);
	СформироватьДанные(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СформироватьДанные(ТЗ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗ.Количество КАК ЧИСЛО) КАК Количество
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗЦены.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	                      |	ВЫРАЗИТЬ(ТЗЦены.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗЦены.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗЦены.НоменклатураКонтрагента КАК Справочник.НоменклатураКонтрагентов) КАК НоменклатураКонтрагента,
	                      |	ВЫРАЗИТЬ(ТЗЦены.Цена КАК ЧИСЛО) КАК Цена
	                      |ПОМЕСТИТЬ ВТЦены
	                      |ИЗ
	                      |	&ТЗЦены КАК ТЗЦены
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Номенклатура КАК Номенклатура,
	                      |	ВТ.Характеристика КАК Характеристика,
	                      |	ВТ.Количество КАК КоличествоУпаковок,
	                      |	ВТ.Количество КАК Количество,
	                      |	ЕСТЬNULL(ВТЦены.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	                      |	ЕСТЬNULL(ВТЦены.НоменклатураКонтрагента, ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)) КАК НоменклатураКонтрагента,
	                      |	ЕСТЬNULL(ВТЦены.Цена, 0) КАК Цена
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	                      |		ПО ВТ.Номенклатура = ВТЦены.Номенклатура
	                      |			И ВТ.Характеристика = ВТЦены.Характеристика
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ.Номенклатура,
	                      |	ВТ.Характеристика,
	                      |	ВТ.Количество,
	                      |	ЕСТЬNULL(ВТЦены.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	                      |	ЕСТЬNULL(ВТЦены.НоменклатураКонтрагента, ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)),
	                      |	ЕСТЬNULL(ВТЦены.Цена, 0),
	                      |	ВТ.Количество
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВТ.Номенклатура.Наименование,
	                      |	ВТ.Характеристика.Наименование");
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("ТЗЦены", РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ТекущаяДатаСеанса(), ТЗ.ВыгрузитьКолонку("Номенклатура")));
	Объект.ТЧТовары.Загрузить(Запрос.Выполнить().Выгрузить());
    ЗаполнитьОстаткиИОбороты();	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьОстаткиИОбороты()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	СУММА(ВЗ.Расход) КАК Расход,
	                      |	СУММА(ВЗ.Остаток) КАК Остаток,
	                      |	СУММА(ВЗ.ЗаказыКлиентов) КАК ЗаказыКлиентов,
	                      |	СУММА(ВЗ.Заказано) КАК Заказано,
	                      |	СУММА(ВЗ.ЗаказаноВнутр) КАК ЗаказаноВнутр
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТоварыВНаличииОбороты.Номенклатура КАК Номенклатура,
	                      |		ТоварыВНаличииОбороты.Характеристика КАК Характеристика,
	                      |		ТоварыВНаличииОбороты.КоличествоРасход КАК Расход,
	                      |		0 КАК Остаток,
	                      |		0 КАК ЗаказыКлиентов,
	                      |		0 КАК Заказано,
	                      |		0 КАК ЗаказаноВнутр
	                      |	ИЗ
	                      |		РегистрНакопления.ТоварыВНаличии.Обороты(&НачалоПериода, &КонецПериода, , Номенклатура В (&Номенклатура)) КАК ТоварыВНаличииОбороты
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ТоварыВНаличииОстатки.Номенклатура,
	                      |		ТоварыВНаличииОстатки.Характеристика,
	                      |		0,
	                      |		ТоварыВНаличииОстатки.КоличествоОстаток,
	                      |		0,
	                      |		0,
	                      |		0
	                      |	ИЗ
	                      |		РегистрНакопления.ТоварыВНаличии.Остатки(, Номенклатура В (&Номенклатура)) КАК ТоварыВНаличииОстатки
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ЗаказПокупателяТЧТовары.Номенклатура,
	                      |		ЗаказПокупателяТЧТовары.Характеристика,
	                      |		0,
	                      |		0,
	                      |		ЕСТЬNULL(ЗаказПокупателяТЧТовары.Количество, 0),
	                      |		0,
	                      |		0
	                      |	ИЗ
	                      |		Документ.ЗаказПокупателя.ТЧТовары КАК ЗаказПокупателяТЧТовары
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |			ПО ЗаказПокупателяТЧТовары.Ссылка = РеализацияТоваровУслуг.Основание
	                      |	ГДЕ
	                      |		ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	                      |		И Не ЗаказПокупателяТЧТовары.Ссылка.ПометкаУдаления
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ЗаказыПоставщикамОстатки.Номенклатура,
	                      |		ЗаказыПоставщикамОстатки.Характеристика,
	                      |		0,
	                      |		0,
	                      |		0,
	                      |		ЗаказыПоставщикамОстатки.КоличествоОстаток,
	                      |		0
	                      |	ИЗ
	                      |		РегистрНакопления.ЗаказыПоставщикам.Остатки(, ) КАК ЗаказыПоставщикамОстатки
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Обороты(, , Регистратор, ) КАК ЗаказыПоставщикамОбороты
	                      |			ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ЗаказыПоставщикамОбороты.ЗаказПоставщику
	                      |				И (ЗаказыПоставщикамОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг)) КАК ВЗ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЗ.Номенклатура,
	                      |	ВЗ.Характеристика");
	Запрос.УстановитьПараметр("НачалоПериода", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Номенклатура", Объект.ТЧТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Мас = ТЗ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика));
		Если Мас.Количество() = 0 Тогда
			Стр.Расход = 0;
			Стр.Остаток = 0;
			Стр.ЗаказыКлиентов = 0;
			Стр.Заказано = 0;
			Стр.ЗаказаноВнутр = 0;
		Иначе
			Стр.Расход = Мас[0].Расход;
			Стр.Остаток = Мас[0].Остаток;	
			Стр.ЗаказыКлиентов = Мас[0].ЗаказыКлиентов;	
			Стр.Заказано = ?(Мас[0].Заказано<0,0,Мас[0].Заказано);	
			Стр.ЗаказаноВнутр = ?(ЭтоКладовщик,0,Мас[0].ЗаказаноВнутр);	
		КонецЕсли;
		Стр.КоличествоУпаковок = Стр.Остаток + Стр.Заказано - Стр.Номенклатура.МинимальноеКоличествоХранения - Стр.ЗаказыКлиентов - Стр.ЗаказаноВнутр;
		Стр.КоличествоУпаковок = ?(Стр.КоличествоУпаковок<0, -Стр.КоличествоУпаковок, 0);
		Если Стр.КоличествоУпаковок > 0 Тогда
			РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьУстановленныхКонтрагентов()
	ТЗ = Объект.ТЧТовары.Выгрузить(, "Контрагент, Количество");
	ТЗ.Свернуть("Контрагент", "Количество");
	Мас = ТЗ.НайтиСтроки(Новый Структура("Количество", 0));
	Для А = 1 - Мас.Количество() По 0 Цикл
		ТЗ.Удалить(Мас[-А]);	
	КонецЦикла;	
	Возврат ТЗ.ВыгрузитьКолонку("Контрагент");
КонецФункции	

&НаСервере
Процедура НастроитьФорму()
	Объект.Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
	Объект.ЦенаВключаетНДС = Ложь;
	ЭтоКладовщик = РольДоступна("Кладовщик");
	Элементы.ТЧТоварыКонтрагент.Видимость = Не ЭтоКладовщик;
	Элементы.ТЧТоварыСуммаСНДС.Видимость = Не ЭтоКладовщик;
	Элементы.ТЧТоварыЦена.Видимость = Не ЭтоКладовщик;
	Элементы.ТЧТоварыЗаказаноВнутр.Видимость = Не ЭтоКладовщик;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗаказов(Номенклатура,Характеристика)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ЗаказыПоставщикамОстатки";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПоставщику"));
	Возврат СписокЗначений;
КонецФункции

&НаСервере
Функция СоздатьЗаказНаСервере(ДанныеЗаполнения) 
	ЗаказСформирован = Ложь;
	Попытка
		ДокЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
		ДокЗаказ.Дата = ТекущаяДатаСеанса();
		ДокЗаказ.Заполнить(ДанныеЗаполнения);
		ДокЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		ЗаказСформирован = Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ЗаказСформирован = Ложь;
	КонецПопытки;
	Возврат ЗаказСформирован;
КонецФункции

#КонецОбласти
